[
  {
    "id": "12883692",
    "title": "Create an iVA in Shaman and Veeva Part 3",
    "description": "",
    "body": "Go to Interactive demo\n81. Once in Veeva Vault click Multichannel Loader.\n82. Click Choose CSV\n83. In the unzipped Shaman folder you will find a csv file. Select it.\n84. You will see a success message. Click Next to upload the zips.\n85. Now select all the zip files from the unzipped Shaman folder.\n86. You see the progress of zips (slides) being uploaded and validated.\n87. Once all zips are validated you can continue.\n88. A summary appears on what Vault is going to do. In this case it will create 1 Presentation with 6 slides and one shared resource slide. To continue, click Complete Load\n89. Vault will now process the zips. This can take 5 to 10 minutes. Please do not logout during the process. Once done, you will receive a notification.\n90. Open the new binder that was just created.\n91. Now we can set all slides to Approved. Let's start with the Shared resource, a special system slide, unique for each IVA, that is not visible in the Binder overview. Click into Slide details to find it.\n92. Click to open Relationships\n93. Click Related Shared Resource\n94. This is the shared resource slide. Click to navigate to it.\n95. On the document page of this Shared resource slide, click to change Draft status\n96. Click Approved.\n97. Click to confirm.\n98. Go back to the Binder. Click the action menu to find Edit Binder. Click to add the Shared resource.\nClick “add” and select “existing documents”\n99. Search for Shared resource.\nSearch for Shared resource using either filters on Product and Country, or searching by document number. Click the plus icon on the right-hand side in order to add to the binder.\n​\n100. Click Dismiss when done.\n102. Shared is added. Click Done editing\n103. Open Chevron menu and choose \"Approve All Slides\"\n104. Now all slides are approved, you can update Draft status to Ready for MLR.\n105. Click Yes to confirm.\n106. Select Submit for Approval\n107. Assign the Marketing and Quality Approver and hit Start\nGo back to Part 1\nGo back to Part 2",
    "url": "https://help.shamancloud.com/en/articles/12883692-create-an-iva-in-shaman-and-veeva-part-3",
    "author_id": 8654068,
    "created_at": 1763573758,
    "updated_at": 1763637334,
    "parent_id": null,
    "parent_type": null
  },
  {
    "id": "12882685",
    "title": "Create an iVA in Shaman and Veeva Part 2",
    "description": "",
    "body": "Go to Interactive demo\n57. Now the new slides are in the right position lets organise the multistates, as you added a new slide and a slide with the reference popup.\n58. You are in multistate mode. Dragging slides will now not move/ reorder, but will group them into multistates.\n59. Click done when ready to return to normal drag and drop mode.\n60. Now you can go in to manage links in the interactive layer.\n61. Add the right link templates to the new slides, as these added slides do not have an interactive layer yet.\n62. Enable the right menu links.\n63. Click to add another link template for main menu.\n64. You can even change the link template if you added menu options in the local version.\n65. Click \"edit interaction\" to edit the link template. These changes will immediately reflect on all slides using this template!\n66. Hit pencil on the slide you want to add the video to.\n67. On the slide go to \"Add Interaction\" and choose \"Add interaction element\"\n68. Here select video.\nPS: many cool interaction elements, you might want to explore more!\n69. This adds a video placeholder. Hit settings\n70. Go to the Video library\n71. Upload an MP4\n72. Check video settings like loop\n73. Close drawer\n74. Hit play\n75. You updated content, managed deleted slides, ordered new slides and added links and a video. The CLM is ready! Go to slide details before you can export.\n76. You need to add details for 4 new slides.\n77. They are in chapter 7.\n78. Lets add the correct data - this is important for analytics later in CRM.\n79. Slide details is 100%. We can go to Export and generate the html!\n80. In the email you find a zip file or download link. Download the zip file and unzip it on your computer. Once done, login to Veeva Vault PromoMats.\nGo back to Part 1\nGo to Part 3",
    "url": "https://help.shamancloud.com/en/articles/12882685-create-an-iva-in-shaman-and-veeva-part-2",
    "author_id": 8654068,
    "created_at": 1763566163,
    "updated_at": 1763637176,
    "parent_id": null,
    "parent_type": null
  },
  {
    "id": "12878898",
    "title": "Create an iVA in Shaman and Veeva Part 1",
    "description": "",
    "body": "Go to Interactive demo\n1. Start by localizing the global IVA in Figma.\n2. Local version ready and approved? Get the PDF to continue.\n3. Log in to Shaman, duplicate global CLM template and replace with local content. Rearrange links, add slide names and download Zip package.\n4. Log in to Veeva Vault PromoMats, use Multichannel loader to upload Zip packages to create the Multichannel presentation and slides. Set to live.\n5. This training manual picks up at step 3, after the local IVA artwork is ready and approved. Let's log in to Shaman to prepare the interactive IVA.\n6. Select the CLM presentation builder.\n7. Head to the ADC Hub to copy the global CLM Presentation. This will save you time of completely rebuilding the interactive layer.\n8. Click the CLM template you need, in this case: Global Baseline - CGM Naive Training.\n9. You can see all source files used in this CLM.\n10. You can preview the content before duplication.\n11. That's the CLM template you need! Head over to the right side to duplicate it!\n12. Make sure you are in the right Shaman account!\n13. Select the right language & 14. Hit Duplicate\n15. The CLM presentation is ready. Go to the Assemble tab.\n16. Welcome to the meeting canvas - the space to organise CLM content. Arrange your materials vertically into chapters, and give each chapter a name, such as Patient Profiles or Patient Benefits. You can drag individual items (slides, videos, PDFs) to reorder.\n17. Or move entire chapters around.\n18. You can also organise content in 'multistates', which means that users can click inside the slide to go to another 'state'. This is often used for pop-ups and references.\n19. In large CLM decks you may need to scroll to see more\n20. Next to organizing content you can make the content clickable. Hit the pencil to access the interactive slide layer.\n21. Let's add an interaction.\n22. Here you find all interaction options: Link types, launch email, interaction elements and External HTML\n23. Select link type: Go to Slide\n24. Drag a click area; a user tap or click inside this area will trigger the go to slide action.\n25. Now hit pencil to set the destination slide.\n26. In this overview you select a destination slide. In case you look for a destination inside a slide group like the reference slide, click the multistate icon.\n27. That opens a drawer showing all multistates in the slide group. Click the reference slide.\n28. Click done to confirm the reference slide as destination.\n29. Link below is green now as it is complete. Go to state 2.\n30. This link (type: Back link) ensures the user can navigate back to state 1.\n31. If you need similar links on multiple pages (like logo, menu) you can access the link templates menu to standardize navigation across your presentation.\n32. In this drawer you find all created link templates. You can enable, edit or mass assign them.\n33. As you can see below the bottom menu links are disabled now.\n34. Click the action menu\n35. Here you can edit, delete, assign to states or mass assign. Lets try mass assign.\n36. You can select multiple slides, or hover over the chapter to select all in the chapter. When ready click Done.\n37. This ends the first introduction to the CLM presentation builder and the CLM template. Click Done to return to the meeting canvas.\n38. Go back to Overview to find resource files and update them.\n39. This is the source file we want to update with the new localised and approved content. Click the action menu.\n40. Select update, after which you need to select the new PDF to upload.\n41. Shaman compares existing slides to new slides - based on the page order. For each slide you can update, or when you have different pages you can choose to add or delete.\n42. Up till now you wanted to update (compare) slides with the new German version. Here we see a slide from the original deck that has been removed in the new deck.\n43. Change Compare to Delete\n44. In this case we see a new slide in the German deck. We don't want to update it.\n45. Change from Compare to Add\n46. Go to the next page.\n47. Another new slide.\n48.\n49. And one more new slide. Change Compare to Add\nAnd one more new slide. Change Compare to Add\n50. Click Continue to confirm updates.\n51. Done! You need to repeat this process per source file. When done, lets check the results in the meeting canvas.\n52. Great! We see that slides are updated to the German version. We can expect the alert Missing content as we deleted original slides in the update process. Lets click to solve.\nGreat! We see that slides are updated to the German version. We can expect the alert Missing content as we deleted original slides in the update process. Lets click to solve.\n53.\nWe see that state 2 is empty. Lets fix that. You can either Change Content (in top menu) or Delete via multistate reorder.\nPS: We do not automatically delete states, as this can cause deletion of links with this slide as destination slide.\nWe see that state 2 is empty. Lets fix that. You can either Change Content (in top menu) or Delete via multistate reorder. PS: We do not automatically delete states, as this can cause deletion of links with this slide as destination slide.\n54. Click the action menu\n55. Choose remove state\n56. What's next? Let's reorder the new slides you added. Scroll to the right: we will always add new content at the end. To move multiple slides in one go, you need to select them all.\nGo to Part 2\nGo to Part 3",
    "url": "https://help.shamancloud.com/en/articles/12878898-create-an-iva-in-shaman-and-veeva-part-1",
    "author_id": 8654068,
    "created_at": 1763550895,
    "updated_at": 1763637096,
    "parent_id": null,
    "parent_type": null
  },
  {
    "id": "12812889",
    "title": "Localise content with Hub",
    "description": "Use case: Market localises global campaign e-mail.",
    "body": "Go to Interactive demo\n1. Click the\nEmail builder\nto start content localization.\nUse your Content Hub in Shaman to support efficient localisation of content across the organisation. In this use case, a global team already created a new, global campaign email including editable images. Now a local user wants to create their own version of this template.\nClick the Email builder to start.\n2. Go to the\nContent Hub\nSwitch to the Hub to browse ready-to-use email content, both from global and from other markets.\n3. Click Original language: Spanish\nShaman autotranslates and summarizes local content into English, so all markets can easily find it and reuse it. To see what I mean, check Spanish as original language.\n4. Click to preview\nYou found an email with spanish as original language - as you can see its translated and summarized already\n5. View in English\nClick to view in English\n6. Lets search now for relevant content.\nThe content Hub is empowered with Semantic search to make sure users find the content they need - across languages.\n7. Click to preview.\nClick to preview the full design and content.\n8. Lets make a duplicate.\nThats exactly the email I need! Let’s create a duplicate so we can start localizing it.\n9. Add a name\n10. Select the language\n11. Choose auto translate\nUse our AI translation feature for quick adoptation across multiple languages.\n12. Include editable visuals.\nShaman doesn’t just translate the HTML content for you. With the Shaman Visual Builder, you can also auto translate and adapt images and graphics for your local email versions. Pretty great, right?\n13. Lets localize!\nClick Duplicate and translate to start the localisation.\n14. The duplicated content is now available in German and ready for further localization.\n15. Preview the inbox preview.\nShaman did also translate the subjectline and preheader. Lets click to preview the first impression.\n16. Go to Design.\nSwitch to the Design tab to further edit the email, fine-tune translations and visuals.\n17. Show original language\nAs you can see the entire email translated, including all images. You can review the translation against the original language.\n18. Let's edit the image\n19. Go to the Visual Library\nGo to the visual library\n20. Open Visual Builder to edit selected image.\nIn the Visual Library, you can select both global and local images and icons from Shaman or Veeva DAM. Images created in the Shaman Visual Builder—like the one selected—can be edited directly from here.\n21. Click the text area.\nYou are now in the Shaman Visual builder. Here you can edit different layers like text, images and shapes. Artwork can be originally imported via PDF. To edit the text, click the text area.\n22. Make edits\nSelect text you want to highlight. Next change color.\n23. Go to Export\nGo to export image\n24. Update image\nClick to generate a new image and update it in the visual library.\n25. Back in Email: Click to replace\nClose the Visual Builder tab. Back in the visual library, you now click replace to swap the old hero image with the one you just created.\n26. Add your local footer\nAlmost ready! Lets add a local footer\n27. Choose a footer\nChoose a local footer with all the correct regulatory requirements prefilled.\n28. Great work — you’ve just built a powerful email designed to make a real local impact.",
    "url": "https://help.shamancloud.com/en/articles/12812889-localise-content-with-hub",
    "author_id": 60699,
    "created_at": 1762890033,
    "updated_at": 1762942647,
    "parent_id": null,
    "parent_type": null
  },
  {
    "id": "12578539",
    "title": "Multiple Subject lines and Pre headers",
    "description": "",
    "body": "In this article:\nOverview\nCreating multiple subject lines and preheaders\nHow the values are exported\nOverview\nMultiple Subject Lines and Preheaders allow you to create and manage several subject lines and pre header options directly from your Email Template Overview page within Shaman for both Approved Email and Marketing Email content.\nThis functionality provides more flexibility when testing or personalising your email content.\nCreating multiple Subject lines and Pre headers\nFrom the Overview page, you can now add, edit, or remove multiple Subject lines and Pre header options.\nTo add more than one option, click \"Add option\" under the Subject Line or Pre header fields.\nEach new entry will appear in a list where you can manage all your options.\nGood to know!\nIf you wish to remove an additional subject line or preheader, simply click the delete (🗑) icon beside it.\nHow the values are exported\nFor Approved Email Templates\nWhen syncing an Approved Email template from Shaman to Veeva Vault PromoMats (VVPM) that contains multiple subject lines or preheaders, the entered values will be automatically added to a custom text dropdown token. The token provides a picklist dropdown with the values you entered, allowing the sales reps to select the preferred option before sending the approved email from your CRM environment.\nFor preheaders, a script is included that reveals the picklist when sending the Email from Veeva CRM, and hides the preheader section again once the Email has been sent out so that the text is not visible in the Email body.\nFor Marketing Email Templates\nWhen exporting a Marketing Email template with multiple subject lines or preheaders, all available options are automatically included in the\nUpload Instructions\ndocument generated at export.\nThis ensures that each variation is clearly listed and ready to be referenced or implemented during the upload process.\nIf you have any questions or face any challenges, please reach out to our Support Team using the chat bubble on the bottom right corner, or email us at\nsupport@getshaman.com\n.",
    "url": "https://help.shamancloud.com/en/articles/12578539-multiple-subject-lines-and-pre-headers",
    "author_id": 6699723,
    "created_at": 1760447296,
    "updated_at": 1761655489,
    "parent_id": null,
    "parent_type": null
  },
  {
    "id": "12303095",
    "title": "HTML Banners in the Visual Builder",
    "description": "",
    "body": "In this article:\nWhat is the HTML Banner Builder?\nParts of an HTML Banner\nDesigning your HTML Banner\nWorking with Overlays\nPrepare for MLR\nExporting your HTML Banner\nWhat is the HTML Banner Builder?\nIn Shaman, marketers can easily create compliant visual banners (static or animated) with a (scrollable) text overlay, eg for mandatory Important Safety Information (ISI). After approval, the banner can be exported as ready-to-use HTML, aligned with IAB banner guidelines. This package is used to publish the banner across ad networks, like Google Ads.\nThe HTML Banner Builder is available as an optional feature within the Visual Builder.\nParts of an HTML Banner\nAn html banner usually has the dimensions of a common banner type like sky scraper, leaderboard or rectangle.\nThe visual you create or select will represent those size dimensions. When you create a new banner and select the banner subtype, Shaman will propose the official sizes.\nThe text overlay will be placed on top of this visual. You can set the position. Usually it will be placed at the bottom or on the right side (landscape format).\nPlease note that this means the visual part of the visual is smaller than the full visual!\n​\nIn the text overlay you can set:\nheader (text and hyperlinks), will not scroll and always remain visible\nbody (text, images, hyperlinks), will be scrollable and autoscroll.\nDesigning your HTML Banner\nTo get started, open the Visual Builder, select the HTML Banner tab and click \"New\" like so:\nA window will appear prompting you to enter the required details such as brand, name, and language. Once these are completed, you can continue in the Overview tab to finalise the visual component details. Next you can create and edit the visual (Design), manage the text and position of the overlay (Overlay) and start the MLR process (MLR). Once done, the banner is ready to be exported (Export) and published in an Ad network.\nThe creation and design of a html banner is similar to a visual. For a more detailed overview of creating a new visual component, setting the details in the Overview page, and designing the visuals in the Design stage, please refer to\nthis article\n.\nFrom the Design tab, you will be presented with a dropdown list of the different visual component types, ensure to select the type\nHTML Banner\n.\nIn the Start Designing dropdown, you can choose how you want to start:\nBlank canvas:\ncreate an HTML Banner “from scratch”\nType of files accepted:\n.JPG, .PNG, .HEIC, .TIFF, .SVG, .PDF (single page PDFs)\nStart with template\n– use an existing HTML banner design template to get started.\nIf you wish to make the image elements of your HTML Banner animated, ensure to enable the toggle\nAnimated\nbefore proceeding to the next step.\nGood to know!\nThis means that existing visuals in Shaman, both static and animated, can be reused as HTML banner. You have 2 options to reuse:\nUse an existing visual template\nDuplicate a visual and change type to: HTML Banner\nWorking with Overlays\nThe overlay is an HTML layer containing text, links, and images, managed directly in Shaman. Once created, an overlay is saved in a reusable library (brand-specific if selected), allowing teams to quickly apply it across multiple banners. This not only saves time but also ensures consistency and compliance.\nIn the Text overlay card, you can either create a new text overlay or select an existing one:\nCreate a new text overlay\nWhen creating a new overlay, add:\nHeader section\nThis section is non-scrollable, it will stick at the top of the scrollable text. So make sure to keep the text short. You can use rich text editor options to add hyperlinks, change color, add superscript.\nBody section\nThis section is scrollable, it will auto scroll and scrollable by viewer. You can add full ISI text (limit 5000 chars).  You can use rich text editor options to add hyperlinks, add bullets, change color, add superscript. You can also add images (from the visual library) in line in the text. Once added, you can resize images in the text.\nNB: Size limits (300kb or even 200kb) is a big challenge when creating banners. If you want to insert images, you should resize those images before uploading (or change file size in the Shaman image editor) and only use images as small as possible. Ideally, they are so small you don't need to resize them in the Body.\nWhen you make changes to the overlay, you can immediately preview the results below in the Preview card.\nOnce done, you can save the Text overlay and reuse in other banners.\nWhen you create the MLR document (PDF), the Text overlay will be added for review.\nWhen the text is brand specific, you should restrict the use of the overlay for a specific brand by enabling the \"Brand related\" toggle. In that case, the Text Overlay will only appear in the list of Text Overlays when working on HTML banners of the same brand.\nGood to know!\nWhen you change a Text Overlay, these changes will apply for all banners where the Text overlay is used (see column 'Where Used' to find these banners). To apply this change, these other banners need to be re-exported.\nOnce the Text overlay is set, you return to the banner overlay. Below in the\nConfigure Overlay\nsection, you can set the following configurations:\nPosition of overlay\n- Determines where do you want to have the overlay (bottom, left, right, top)\nSize overlay\n- Defines the pixel dimensions of the overlay and how much space it occupies within the design\nOpacity overlay background -\nAllows you to set a percentage of opacity for the text section of your overlay\nTarget url -\nYou can add a URL where the user will be directed to when they click on the HTML banner (visual area - the clicks in the text overlay can be set using hyperlinks).\nFrom the\nPreview\nsection, you can view your HTML banner exactly as it will appear once published. Any changes you make in the design or overlay configuration will be reflected here in real time, allowing you to check that the layout, text, and visuals appear as intended.\nStart the MLR process\nWhen the banner visual and overlay are ready, you can prepare for the MLR process. Go to the MLR tab, where you can sync the content to Veeva Vault, either by creating a new MLR document in Vault with rendition in Shaman, or link to an existing placeholder and sync the rendition file (PDF). When generating the HTML banner rendition PDF, Shaman will add:\nOverlay on top of the visual; showing the final viewable result\nIf animated, Shaman will generate a frame per scene, incl the overlay\nAdditional page in PDF containing the full Body section of the overlay, including clickable links.\nFrom this section, you can also export your HTML banner as a PDF file. In that case, these PDF additions are optional:\nThis article\nprovides detailed, step-by-step instructions for the MLR process and exporting your visual component.\nExporting your HTML Banner\nWhen the banner is MLR reviewed and approved, you can proceed to the Export tab.\nHere, you can download the HTML package of the banner (zip), including:\nindex.html\n\\assets\nimage visual (png or gif)\nother images used in the body section\nIt is important that you check the size of the .zip before you send it to the publishing platform. Most platforms have a size limitation, the official AIB guidelines is 300kb.\nEspecially when you have an animated banner, this can be challenging. In that case make sure you set lowest export settings:\nOther tips to reduce gif file size:\nremove text and shape animations\nremove transitions\nreduce duration\nYou can also refer to\nthis article\nfor more information on creating animated visuals in Shaman.",
    "url": "https://help.shamancloud.com/en/articles/12303095-html-banners-in-the-visual-builder",
    "author_id": 6699723,
    "created_at": 1758032069,
    "updated_at": 1758546710,
    "parent_id": null,
    "parent_type": null
  },
  {
    "id": "12020388",
    "title": "Veeva Vault Document Owner",
    "description": "Learn how to assign a Veeva Vault owner to the HTML documents created in Shaman ready for export to VVPM.",
    "body": "In Shaman you can now manually select and assign a Veeva Vault document owner when exporting content from Shaman to Veeva Vault.\nIn this article:\nIntroducing Veeva Vault Document Owner\nHow to assign a document owner to content created in Shaman\nHow to assign a document owner to an MLR document\nIntroducing Veeva Vault Document Owner\nThis function will help to save you time and streamline your workflow, we’ve added a handy new option that allows you to manually select a Veeva document owner in Shaman during export, giving the document owner full control over the document workflow in Veeva Vault.\nGood to know!\nThere is no need to manually reassign ownership after export, the document owner selected in Shaman will be automatically assigned as owner in Veeva Vault\nVeeva owners do not need to be Shaman users\nHow to assign a document owner to your content in Shaman\nWhether you are exporting an email template, an email fragment or a CLM presentation, you will notice a field named\nDocument Owner in Veeva Vault\nvisible on the Export page:\nFrom here, simply select the appropriate document owner from the dropdown list before exporting.\nAfter making your selection, the document will be synced to Veeva Vault with the chosen Veeva owner automatically applied.\nGood to know!\nOnce your content has been exported to Veeva Vault, the owner is set and cannot be changed within Shaman.\nHow to assign a document owner to an MLR document\nWhen creating an MLR document in Shaman, you’ll see a field titled\nDocument Owner in Veeva Vault\non the creation page.\nProceed to enter the MLR information as usual, making sure to select the appropriate document owner from the dropdown list.\nOnce the MLR document is synced, the document will arrive in Veeva Vault with the selected owner assigned.\nIf you would like to enable the Veeva Vault Document Owner function in your account, or if you need help adding Veeva Vault owners to the list, please reach out to your Shaman account manager, or you can contact us at\nsupport@getshaman.com\nfor more information.",
    "url": "https://help.shamancloud.com/en/articles/12020388-veeva-vault-document-owner",
    "author_id": 6699723,
    "created_at": 1755266671,
    "updated_at": 1757944858,
    "parent_id": null,
    "parent_type": null
  },
  {
    "id": "11424561",
    "title": "Content review in Shaman",
    "description": "Take a closer look at how Content Review can help you save time and syncs",
    "body": "In this article:\nWhat is Content Review in Shaman?\nHow does Content Review work?\nTaking a look at Content Review in action\nWhat is Content Review in Shaman?\nContent review is a new feature in Shaman which makes the creation of compliant and effective email content in Shaman even easier.\nYou might already be familiar with “Audit” in Shaman, which performed a similar review of email content at the Design stage. Content Review offers an easier to use UI (than Audit),  effortlessly integrating with your existing Design process, as well as even more useful functionalities than before.\nWe hope that by bringing these details to your attention during the content creation process (rather than in the testing process), Content Review will save you time and syncs.\nContent Review can be tailored specifically to your account requirements, so get in touch with your dedicated Customer Success manager to find out how your content creation team can start benefiting from this great new feature.\nHow does Content Review work?\nContent Review scans the content of your email design, and based on which Critical and Warning options you have chosen (as part of your account configuration), you might see:\nCritical:\nObservations which must be “resolved” before syncing to Veeva Vault:\nUnsubscribe link missing: This notification will show if there is no URL/ Veeva token which offers readers the option to “Unsubscribe” from the email campaign\nVeeva tokens: You will be notified if a Veeva token is incomplete or incorrectly completed.\n​​Button link missing: This notification will show there is no Action (eg. open a URL, send an email, download a Veeva hosted document) added to a button.\nHyper text link is missing: You will be notified if there is no URL/ Veeva token populated in a hyperlink created for text in an email.\nWarning suggestions:\nYou can decide to not address the Warning suggestions and sync content to Veeva Vault with open Warning notifications. But we highly recommend you review the comments to avoid unnecessary edits or future syncs.\nDisclaimer link missing: A warning notification will appear if there is no URL link/ Veeva token populated for a Disclaimer\nSmPC/PI link missing: You will be notified if there is no URL link/ Veeva token populated for a SmPC/ PI document.\nApproval number missing: A warning notification will appear if there is no approval number added to your Email Design. (Approval number can normally be found within the MLR approval email/ notification from your internal approval system).\nPrivacy policy link missing: This warning notification will appear if there is no URL populated in the Privacy policy of this email campaign.\nNo button found: You will be notified if there is no button/ call to action in your Email Design.\nNo salutation tokens found: Salutation tokens are any Veeva tokens which address the HCP directly, for example #{{Account.Name}}, #{{accTitle}},#{{accFname}} or #{{accLname}}. A warning notification will appear if there are no such Veeva tokens in your Email Design.\nNo sender tokens found: Sender tokens are any Veeva tokens which contain details about the Sender (sales team/ end user) of the Email. For example, #{{userEmailAddress}}, #{{userName}} or #{{userPhoto}}\nConsider using a picklist:\nIf a Veeva custom picklist token is used which does not contain options (for example {​{​customText[options]}}, a warning notification will appear.\nImage alt text is missing: Alternative text can be added to images uploaded to email content in Shaman which will show if the images in the email are not successfully downloaded when the HCP opens the email. You will receive a Warning notification if there is no alternative text added to an image.\nProofread*:\nProofread scans the text copy within your email design and alerts you to any formatting, spelling or grammatical errors, as well as suggestions which make your key message clearer or more consistent with the rest of the copy in your email.\n* - Proofread is available in Content review as part of the AI package. Reach out to your dedicated Customer Success Manager to find out more details.\nTaking a look at Content Review in action\nWhen working on the design of an email template or fragment, on the right hand side of the email canvas you will see the button “Content Review”.\nYou can click on any of the corresponding “Critical”, “Proofread” or “Warning” to view the notifications for each category.\nSimply click on the notification to view further details about which part of the email content needs to be reviewed.\nIn the case of “Proofread” notifications, you can choose to “Apply” the suggestion directly to your email content. For example, take a look at this suggestion which states the format of the time which the event begins is incorrect. We can “Apply” the suggestion, or choose to “Ignore” it.\nIn the case of “Warning” notifications, you can choose to “Ignore” them to remove the warning message from the Content Review panel.",
    "url": "https://help.shamancloud.com/en/articles/11424561-content-review-in-shaman",
    "author_id": 5298352,
    "created_at": 1747899563,
    "updated_at": 1748851042,
    "parent_id": 4027987,
    "parent_type": "collection"
  },
  {
    "id": "11115040",
    "title": "Shaman Hub for Marketing Email",
    "description": "Find out how to reuse content from Shaman Hub for Marketing Email, and how to share your most engaging Marketing Email content to Shaman Hub",
    "body": "In this article:\nWhat is Shaman Hub?\nHow can I copy Marketing Email content from Shaman Hub?\nHow can I contribute to Shaman Hub?\nWhat is Shaman Hub?\nWith Shaman Hub, sharing Marketing Email content from a global to local level, or a local to local level has never been easier (or quicker!).\nShaman Hub for Marketing Email will only show you content which has an MLR document attached, meaning that non compliant content is kept safely out of reach.\nIn this article we will take a closer look at how you can search for Marketing Email content in Shaman Hub, how you can save it to your local list of Marketing Email content to personalize as you please and very importantly - how you can share your best Marketing Email content to Shaman Hub to inspire your colleagues and contribute to the overall success of your organization!\nHow can I copy Marketing Email content from Shaman Hub?\nAfter logging into Shaman, click “Marketing Email” in your builder dashboard.\nFrom the Marketing Email builder overview, click the “Shaman Hub” tab.\nWhen you arrive at your hub page, you will see some search filters on the left hand side, a list of content that has already been shared on your hub, as well as a search bar at the top of your screen to type keywords to help you find the right content for you. Let's take a closer look.\nSearch filters on the left:\nSource:\nGlobal and local - You can choose to search for content that has been created at a global, or local level by clicking to select the corresponding filter.\nOriginal Brand:\nPerhaps you are working on a specific brand team, and would like to find content relating to this specific brand. If so, this is the search filter for you.\nOriginal language:\nyou can search for content which has been created in your local language or in other languages.\nType:\nyou can search for email templates, or dynamic content blocks.\nCountry of origin:\nyou can search for content created by a specific country using this filter.\nGood to know!\nIf you do not see a value in the list of filters, eg. a brand or a country, it is most likely that content for this brand or country has not yet been shared on the hub, but don´t hesitate to contact your Shaman Customer Success Manager or the Shaman Support Team (support@getshaman.com) for more information.\nSearch bar at the top: Simply start typing any keywords to find content relevant to your email campaign.\nList of content shared on the hub: Here you can see all content currently available on your hub, sorted based on relevancy. Let’s take a look at the information you can see in this email overview.\nTitle:\nThe title of the Marketing email content\nLocal or Global:\nWhether it has been created at a global or local level.\nSubject line:\n(in case of email templates)\nSummary:\nAn AI generated summary of the contents of the email content (in English)\nCreated by:\nThe name and franchise of the colleague who created this content\nLikes:\nHow many people have “liked” the email content\nDuplicates:\nHow many people have duplicated the content to their local work area\nDate added:\nThe date the content was added\nExpiry date:\nThe date this content will expire (in Shaman Hub)\nGood to know!\nAny newly shared content to Hub will have a “new” tag added automatically. The “new” tag remains for two weeks, advising you which content has been added recently to the Hub.\nTo take a closer look at email content presented in the email overview page, simply click anywhere within the email details shown.\nYou will be redirected to a page where you can preview the email content in both Desktop and responsive formats (on the left hand side of your screen).\nOn the right hand side you will see a “Duplicate email” section. If you like what you see in the preview, you can complete the details in the “Update details and duplicate to your accounts” section.\nAccount:\nSelect the account where you wish to copy this email content to.\nName:\nAdd a new name or title to your email content\nBrand:\nYou can choose to keep the inherited brand assigned to your email content, or you can click “Update” to change it to a different brand.\nLanguage:\nSelect the language you wish to use in your email content. If it´s different from the language in the original content, don´t worry we´ve got you! Shaman will automatically translate this to the language you have selected.\nOnce you have set these details, click “Duplicate”.\nGood to know!\nIf you select another language in the duplication step, Shaman will automatically translate the email to the selected language, using AI translation. Make sure that the translation result is reviewed carefully.\nOnce you have clicked the  “Duplicate” or “Duplicate and Translate” button, you will be redirected to the email overview page (you can take a look at\nthis article\nto revise this part of creating email content in Shaman.)\nClick “Design” to start personalizing the design of the email content you have copied.\nIf you have any doubts and want to check the original text, simply click “Show original email”.\nTo review any steps about adding content to your email content,\nplease click here\n, or how to export your email content from Shaman,\nplease click here.\nCheck out this video to see how to duplicate Marketing Email content from Shaman Hub in full:\nHow can I contribute to Shaman Hub?\nSharing your Marketing email content on Shaman Hub could not be easier.\nOnce you are ready to export your content, before you can share it with Shaman Hub, you need to create an MLR document for your email template or link it to an existing MLR document. This is because only approved materials should be shared to Hub for your colleagues to reuse.\nAt the top of your export options, you will see the following criteria that you can select to share with your colleagues, based on:\nBrand:\nYou can choose to only share with colleagues working with the same brand as you\nCountries:\nYou can choose to only share content with specific countries\nTherapeutic Area:\nYou can choose to only share content with users working in similar therapeutic area to you, for example: Neurology, Cardiology, etc.\nIf you do not want to share your Marketing email content to Shaman Hub, be sure to deactivate this toggle to prevent your email content from being shared.\nOn clicking “Export to Hub”, your content will be shared to your Shaman Hub.",
    "url": "https://help.shamancloud.com/en/articles/11115040-shaman-hub-for-marketing-email",
    "author_id": 5298352,
    "created_at": 1745246264,
    "updated_at": 1745247385,
    "parent_id": null,
    "parent_type": null
  },
  {
    "id": "10944908",
    "title": "How to create a content block",
    "description": "Everything you need to know about creating a content block in Shaman",
    "body": "In this article:\nHow to create and export a content block\nDesign step: Completing the design of the content block\nTest step: Testing the content block\nMLR step: Exporting a content block as PDF\nExport step: Setting the content block to live\nHow to add a content block to email content\nWe are delighted to introduce content blocks and design layouts to approved email and marketing email content in Shaman.\nContent blocks in Shaman can be easily created, added, recycled and reused across email campaigns and can also be shared to other Shaman accounts via Hub.\nIn this article we take a look at how to create a content block. (If you are looking for new to content blocks and design layouts,\nwe recommend you to take a look here.\n)\nHow to create and export a content block\nOnce you have logged in to Shaman and clicked the \"Approved email icon\" from the menu on the top of your screen, you will see different tabs for email templates, email fragments, template fragments, content blocks and design templates.\nSelect the “Content Blocks” tab and click the “New button” to get started.\nYou will then see a pop-up message prompting you to complete the obligatory information for your content block comprised of the below fields:\nName - A free text field to add a name for your content block. This is an obligatory field.\nBrand - Select a specific product for the content block.\nLanguage - Select a language for the content block.\nThen click \"Create\" once you have completed this information.\nGood to know!\nOnly one product can be selected per content block.\nYou will be redirected to the \"Overview\" page of your content block.\nGeneral:\nName\nLibrary tags (\ncheck out this article for more information)\nBrand\nLanguage\nBased on: (How was the content block made, from scratch, from design template, duplicated from another content block, etc)\nStatus: Content blocks in Shaman can be either “Draft” or “Live” status. These statuses refer to whether the content block has been set to live in Shaman or if it remains in draft status. If the content block is “live”, it is available to be added to email content.\nGood to know!\nThis status only exists in Shaman, as a way of managing which content is ready to be shared to other email content.\nHistory: With Email Versions History in Shaman, you see the full story of all versions previously created for a specific email template or fragment at a glance. You have complete visibility on what is happening with your email content and can effortlessly keep track or revert back to any previously saved versions, giving you further freedom (and peace of mind!) in the content creation process.\nEach time an email template or fragment is edited and saved by you or a member of your team, in the HTML editor by clicking “Done”, Shaman will save a new version of the email.\nTake a look at\nthis article\nfor further information.\nWhere used: In this section you can see at a glance every email template or fragment that the content block has been added to.\nDesign step: Completing the design of the content block\nTo start working on the design of the content block, click the \"Design\" tab at the top of the screen.\nBefore being directed to the email editor, your design template gallery will appear. Here you will be able to see all available design templates for the content you are creating relating to the Product/brand you are working with.\nYou have two options:\nCreate a content block using a design template as a base - Simply click on the design template you wish to use to select it. You can also click the zoom icon to preview the design template before selecting it, or search using the filter box at the top of the screen to find a specific design template.\nOnce you have selected the design template you wish to use, you will be directed to the email editor. A copy of the design template will be generated in the email editor, ready for you to edit as you wish.\nCreate a content block from scratch, (a completely blank canvas) - click the “Start without template” button in the top right corner. You will then be redirected to a blank canvas in the email editor to start building your email content.\nYou can now start working on adding content to your content block. You might want to take a look at\nthese articles\nto give you some inspiration!\nOnce you have finished creating the content block, click the “Done” button in the top right-hand corner.\nTest step: Testing the content block\nThe inbox preview feature within the “Test” tab allows you to test your approved email content through a number of different email clients and devices.\nClick here to read more!\nMLR step: Exporting a content block as PDF\nIn the MLR step, you can create an MLR document for your content block or link to an existing content block (depending on your account settings).\nCheck out this article for more information.\nYou can also download a PDF of the content block, or send a PDF of the content block to your email inbox.\nExport step: Setting the content block to live\nIf the content block is in draft status, you will see the option to \"Set to live\". You can simply click “Set to live! To make the content block available to add to email content.\nIn the following section “Available for use” you can determine where to publish the block - to the approved email builder, marketing builder, landing page builder or all of the above.\nOnce you have clicked “Set to Live”, you will see that the status has changed to \"live\", which means we are ready to move on to the next step: adding a content block to your email fragment or template.\nHow to add a content block to an email fragment or email template\nLet´s imagine that you have created a new email fragment or template, have completed the email details, and are now in the email editor ready to add a content block to your email fragment or template.\nFrom the menus on the right-hand side, select the blocks menu. Find the custom block icon and simply drag and drop that icon onto your email canvas.\nYou will notice that a gray placeholder custom block has been added to the email canvas. To add your own content block to the email canvas instead, click the select placeholder button from the menu on the left-hand side.\nYou will then see all content blocks available, simply click on the content block you wish to use to select it. You can also filter using the date dropdown options available (start date and end date as the names imply) or click the zoom icon to preview the content block before selecting it, or search using the filter box at the top of the screen to find a specific content block.\nOnce you have selected the content block you wish to use, it will appear on your email canvas where the custom block placeholder was previously. You can begin to edit the content block as you wish.",
    "url": "https://help.shamancloud.com/en/articles/10944908-how-to-create-a-content-block",
    "author_id": 5298352,
    "created_at": 1742999605,
    "updated_at": 1747144447,
    "parent_id": null,
    "parent_type": null
  },
  {
    "id": "10940083",
    "title": "Organizing CLM presentation content with library tags",
    "description": "Learn how you can organize CLM presentation content using tags",
    "body": "In this article:\nHow to create a new tag\nHow to add tags to CLM presentation content\nHow to remove a tag from CLM presentation content\n“Tags” help you manage and organize CLM presentation content in Shaman.\nYou can create a tag that is specific to a project, team, or even team member, and then add this tag to each CLM presentation to easily manage all content related to that tag.\nTags are created, managed, and visible only within Shaman, they will not show in Veeva Vault or Veeva CRM.\nGood to know!\nIf you also have the Shaman email builder active in your account, you can create and add “Global” tags, which will be available to use for both email and CLM presentation content.\nHow to create a tag\nTags in the CLM presentation builder are created through the CLM presentation overview page.\nSelect any one of the small square boxes to the left of the CLM presentations.\nTo create a new tag, click “Manage tags”, then click the green “New” button in the top right corner.\nYou will now see that a new blank tag has been added to your list of tags in the CLM presentation builder. To add a name to your tag, simply begin typing in the blank space beneath the name field. You can also update the color of your tag, by selecting from the options available in the dropdown list.\nYou can also decide which type of content this tag should be available for: CLM presentation, or All content (Global). Selecting the \"CLM presentation\" tag will make this tag available for use only for CLM presentation content, and selecting the \"All content (Global)\" tag will be available for use in the email builder, and the CLM presentation builder.\nOnce you are happy with the details you have added to your tag, click \"save\" using the button next to the newly created tag. Then click \"back to overview\" to return to the CLM presentation overview page, and keep reading to find out how to assign your recently created tag to CLM presentation content!\nHow to add a tag to CLM presentations\nThere are two ways that you can add tags to CLM presentations, from the overview of CLM presentations, or from the overview page of a specific CLM presentation.\nFrom the overview of CLM presentations page:\nSelect the CLM presentations that you wish to add tags to (by clicking the small square boxes to the left of the CLM presentations.\nAt the top of the list of CLM presentation content, type the name of the tag you wish to assign into the free text field “Add tags”. A dropdown list will then appear with a list of all the available tags in your account. Simply click to select the tag(s) you wish to add. When you have finished selecting tags, click the “Add” button on the right-hand side of the screen.\nYou will then see that the CLM presentation(s) selected has now been assigned the chosen tags.\nHow to remove tags from CLM presentation content\nTo remove a tag from a CLM presentation, simply click the “x” delete icon and the tag will be removed.\nTo remove a tag completely from your account, first, make sure it is not being used (as you will not be able to delete it). Select any one of the small square boxes to the left of the CLM presentations and then click “Manage tags”.\nThen, click “Delete” next to the tag you wish to delete.",
    "url": "https://help.shamancloud.com/en/articles/10940083-organizing-clm-presentation-content-with-library-tags",
    "author_id": 5298352,
    "created_at": 1742983649,
    "updated_at": 1742989477,
    "parent_id": null,
    "parent_type": null
  },
  {
    "id": "10727447",
    "title": "test",
    "description": "",
    "body": "test",
    "url": "https://help.shamancloud.com/en/articles/10727447-test",
    "author_id": 5040669,
    "created_at": 1741344684,
    "updated_at": 1741344770,
    "parent_id": null,
    "parent_type": null
  },
  {
    "id": "10718014",
    "title": "Usage analytics FAQs",
    "description": "Find your most commonly asked questions about Usage analytics answered here",
    "body": "Which users can view the analytics dashboard?\nYou can choose which users in an organization can have access to the dashboard with an easy to use toggle in the user profile (within the user management section of Shaman). Simply activate the toggle to allow access to the usage analytics dashboard.\nGood to know!\nYou need to have a “User manager” profile in Shaman to access the user management section. If you have any doubts about your profile in Shaman, please contact your dedicated Customer Success Manager or our support team.\nWhat is the difference between a TA and a country?\nA TA is a therapeutic area such as Cardiology or Neuroscience. A single country eg. Germany can have multiple therapeutic areas (eg. Shaman Germany Cardiology, Shaman Germany Neuroscience).\nIs it possible to view statistics from previous years?\nYou can access statistics dating back to as long as your Shaman account has been active. Select the date range desired using the “Date range” search filter.\nCan I export usage analytics from Shaman?\nYes, when you hover over any statistic, in the top right corner you will see three vertical dots to select “Menu options”. When you click this icon, two further options will appear. Choose the “Export to CSV” option to download the CSV directly to your computer.",
    "url": "https://help.shamancloud.com/en/articles/10718014-usage-analytics-faqs",
    "author_id": 5298352,
    "created_at": 1741252792,
    "updated_at": 1741336050,
    "parent_id": 11925873,
    "parent_type": "collection"
  },
  {
    "id": "10717898",
    "title": "Hub analysis statistics in Shaman",
    "description": "Find out which content is the hit of your Hub!",
    "body": "In this article:\nWhat is Hub analysis\nInformation available in Hub analysis\nSearch filters\nContributors / content available in Hub\nContent reuse\nConsumers of Hub content\nHub content trending\nGlobal templates\nWhat is Hub analysis\nIf you have Shaman Hub activated in your account, you will already know the great benefits of sharing all types of content via the Hub from a global to local level, or a local to local level. With Hub analytics in Shaman, you can review insightful statistics about which content is being shared, by who, and how many times and where content is being duplicated to from the hub and you can even analyse recent trends with Hub activity in your account.\nInformation available in Hub analysis\nSearch filters\nUsing the search filters at the top of the page, you can refine your statistics search to include specific countries, Shaman accounts or a specific date range.\nYou can select a single or multiple countries using the corresponding check box next to the country (or countries) you wish to select.\nIf you have multiple Shaman accounts (for example different accounts for separate therapeutic areas) you can choose a single or multiple Shaman accounts to view (using the checkbox in the drop down list of Shaman accounts).\nIn the date range section you can refine the data available to a specific time period. This is extremely useful for refining information by quarter, or even annually or monthly. Simply select the date range by either using the calendar or you can also manually input the date directly into the date range field.\nAdditional options per statistic\nWhen you hover over each set of statistics in Shaman, you will see additional options in the top right corner of the infographic box which allow you to:\nMaximise\nView applied filters\nDrill down from Document Type\nView summary data/ Export to CSV\nContributors / content available in Hub\nIn this section you can review insightful statistics about what content is being shared to Hub, and by who.\nTotal documents available in Hub\nTotal documents in Hub per document type\nIn this section you can review the total amount of documents shared in Hub, with a breakdown showing percentages of each document type shared (eg. approved email, CLM presentation, marketing email, etc).\nContent added per country\nContent per content type per country\nHere you can see how much content has been shared to Hub per country.\nContent added per brand\nContent per content type per brand\nIn this infographic you can see how much content has been shared to Hub per brand across all Shaman accounts selected.\nContent added per user (top20)\nContent added per Shaman account - click for user drill down\nIn this section you can review how much content has been shared by the 20 users who have shared the most content to Hub in Shaman. You can click to see the exact number of content created by each user.\nContent added per Shaman account/ users\nContent added per Shaman account - click for user drill down\nHere you can take a look at the amount of documents added per Shaman account (this includes countries and therapeutic areas).\nContent added per country/ brand\nMatrix of content added per country and brand\nIn this infographic you can see how many documents have been shared to Hub for each brand, in each of the countries selected. In addition, the higher the number of documents, the deeper the shade of green will be. So you can see at a glance which countries have been sharing the most content, and for which brand.\nContent reuse\nIn this section you can find everything you need to know about how the content shared to Hub is being received and used.\nDocuments views\nHere you can review the amount of times documents have been viewed in the Hub.\nDocuments likes\nHere you can review the amount of times documents have been “liked” in the Hub. Shaman users can “like” a piece of content by clicking the thumbs up icon below the content description in the Hub Overview page.\nDocuments duplicates / Reuse\nAnd lastly in this section you can see how many times documents have been duplicated from Hub, a handy measure of how much time and energy Shaman Hub is saving your organi<ation!\nMost duplicated content\nMost duplicated content (>5x)\nHere you can see the biggest hits of your Hub to date - the 5 most duplicated documents from Hub.\nMost popular document types\nTotal documents in Hub per document type\nIn this infographic you can see a breakdown of the amounts of each document type that are being shared to Hub. This is useful information to determine which content could be reused at a greater rate in the future.\nDocuments AutoTranslated\nHere you can see how many documents have been translated during duplication from the Hub.\nConsumers of Hub content\nIn this section we take a look at who is utilizing the content available in Hub the most.\nConsumers of Hub content: Shaman accounts\nMost active consumers: Shaman accounts\nHere you can review which Shaman accounts have users that are most actively duplicating content from Hub.\nConsumers of Hub content: countries\nMost active consumers: countries - click to drill down to users\nAnd to dive deeper into the most active consumers of Hub, here you can review which countries are most actively duplicating content from Hub.\nConsumers of Hub content: users\nList of most active consumers: Shaman users (top20)\nAnd lastly, you can review which specific users of Shaman are most actively duplicating content from Hub.\nHub content trending\nIn this section you can review the trends in how content is being added to Hub.\nTrend - Adding content\nContent added last 90 days vs quarter before\nIn this section you can see how much content has been shared to Hub in comparison with content shared in the quarter before. This includes all types of content created in Shaman (CLM presentation, approved email, marketing email, slide projects and visual components).\nDocuments added per month\nNew documents added to Hub per month\nThis infographic contains how many new documents have been shared per month, illustrating the highs and lows of content reuse over the last year.\nCountry contributors\nNew documents added per country per month\nHere you can see how many new documents have been shared in the last year, broken down into types of content.\nGlobal templates\nIn this section you can review how often Global content is being reused at a local level, with specific statistics available per builder, brand and type.\nTemplates per builder\nLive global templates per builder\nIn this section you can review how many global templates have been shared, broken down into builder (eg. approved email builder, CLM builder, Visual builder, etc).\nTemplates per type\nLive global templates per type - click to drilldown per subtype\nHere you can see how many global templates have been shared, with statistics of each type of document (eg. approved email, CLM, Visual component, etc).\nTemplates per brand\nLive global templates per brand\nHere you can see how many global templates have been shared, with a breakdown per brand.\nMost used templates - email\nEmail documents exported to Veeva\nIn this infographic you can see which approved email templates have been reused the most, with additional information about which percentage of email templates (duplicated from Hub) have then been synced to Veeva Vault.\nMost used templates - slides\nSlides exported to Veeva\n(Available if the Slide builder is active in your account).\nHere you can review which slides have been reused the most, with additional information about which percentage of slides (duplicated from Hub) have then been synced to Veeva Vault.\nMost used templates - visuals\nVisuals exported to Veeva\n(Available if the Visual builder is active in your account).\nIn this infographic you can see which visual components have been reused the most, with additional information about which percentage of visual components (duplicated from Hub) have then been synced to Veeva Vault.",
    "url": "https://help.shamancloud.com/en/articles/10717898-hub-analysis-statistics-in-shaman",
    "author_id": 5298352,
    "created_at": 1741251075,
    "updated_at": 1741336969,
    "parent_id": 11925873,
    "parent_type": "collection"
  },
  {
    "id": "10717832",
    "title": "Content analysis statistics in Shaman",
    "description": "Everything you need to know about content statistics in Shaman",
    "body": "In this article:\nWhat are content analytics\nInformation available in content analytics\nUsing search filters to refine the available data\nAdditional options per statistic\nOverall numbers\nTrends\nWhat are content analytics\n“Content analytics” can be found in the first tab in Usage Analytics in Shaman. As the name suggests, this section provides insightful statistics on what content is being created, what type of document, which content is being synced to Veeva Vault, by which country, therapeutic area, for which brand, and how it is being created - from a design template or from scratch.\nInformation available in content analytics\nUsing search filters to refine the available data\nUsing the search filters at the top of the page, you can refine your statistics search to include specific countries, Shaman accounts or a specific date range.\nYou can select a single or multiple countries using the corresponding check box next to the country (or countries) you wish to select.\nIf you have multiple Shaman accounts (for example different accounts for separate therapeutic areas) you can choose a single or multiple Shaman accounts to view (using the checkbox in the drop down list of Shaman accounts).\nIn the date range section you can refine the data available to a specific time period. This is extremely useful for refining information by quarter, or even annually or monthly. Simply select the date range by either using the calendar or you can also manually input the date directly into the date range field.\nAdditional options when viewing usage analytics\nWhen you hover over each set of statistics in Shaman, you will see additional options in the top right corner of the infographic box which allow you to:\nMaximize (the statistic window)\nView applied filters (in the most recent search)\nDrill down from Document Type (break down statistic into document types - where relevant).\nView summary data/ Export to CSV\nOverall numbers\nThe first section of data presents “Overall numbers” of total documents created in Shaman. Let´s take a closer look.\nTotal documents created: Total documents with breakdown per document type/subtype.\nIn this infographic you can see at a glance the percentage of content being created in Shaman, across all of the Shaman builders (e.g. approved email, CLM presentation or Visual components.)\nVeeva status documents: Total documents with breakdown Veeva status\nHere you can see which percentage of content has been synced to Veeva Vault, and what status the content has in Veeva Vault. This information is a total of all the content created across the builders in Shaman, so it may surprise you to know just how much of the content created in Shaman is approved in Veeva Vault!\nVeeva commits per document: How often a document is synced with Vault\nOrdinarily a sync to Veeva Vault will only happen after:\nChanges have been made to the content itself\nThe MLR document has been updated\nThis very useful statistic reveals how much content is being created and synced just once, and how much content receives multiple updates and syncs to Veeva Vault.\nContent created per country: Map with documents per country\nIn a map infographic you can see at a glance which countries have created more (or less) content. The deeper the shade of green of the country, the more content created in that country.\nContent created per brand: Overview of (sub)documents per brand\nIn this graph you can see which brands have had the most documents created, followed by all brands in the accounts selected (in order of most to least documents created). In each brand, you can also see a breakdown of which type of content is being created (eg. Approved email, Marketing email, Slide projects or CLM presentations).\nContent type created per country: New content types created per country\nIn this graph you can see which countries have had the most documents created, followed by all countries included in the search (in order of most to least documents created). In each country, you can also see a breakdown of which type of content is being created (eg. Approved email, Marketing email, Slide projects or CLM presentations).\nContent matrix per country and brand: Document creation heat map per country/ brand\nIn this infographic you can see how many documents have been created for each brand, in each of the countries selected. In addition, the higher the number of documents, the deeper the shade of green will be. So you can see at a glance which countries have been creating the most content, and for which brand.\nContent type created per account: New content types created per account\nHere you can check how many new documents have been created (rather than being duplicated from an existing document), and again you can see a breakdown of which types of content are being created.\nStart document creation: How new documents are created - per type\nIn this infographic you can see at a glance how much content is being created “from scratch” (that is to say, a new blank document), duplicated from existing documents, duplicated from hub, or created from a design template. This can be extremely useful to know how much content in each account is being reused and recycled, and which content tends to be created from scratch each time.\nTrends\nContent creation trend: Content creation last 90 days vs quarter before\nIn this section you can see how much content has been created in comparison with content created in the quarter before. This includes all types of content created in Shaman (CLM presentation, approved email, marketing email, slide projects and visual components).\nNew documents created: New documents per month\nThis infographic contains how many new documents have been created per month, illustrating the highs and lows of content creation over the last year.\nNew document types created: New documents per document type month\nHere you can see how many new documents have been created in the last year, broken down into types of content.\nNew documents per brand (top5): New documents per brand (top5) per month\nIn this infographic you can see a comparison between new documents created for the “Top 5” brands. The “Top 5” refers to the 5 brands which have had the most content created.\nNew documents per TA: New documents per TA per month\nHere you can review the new documents created per TA - TA refers to therapeutic area rather than country or brand.\nNew documents per country (top5): New documents per country (top5) per month\nIn this infographic you can see a comparison between new documents created for the “Top 5” countries. The “Top 5” refers to the 5 countries which have had the most content created.\nDocuments vs templates\nDocument / template ratio per content type illustrates how many documents have been created per design template.\nTotal documents created\nTotal documents with breakdown per document type/ subtype\nHere you can see at a glance the percentage of different types of content created in Shaman. For example, 51% of content created in the test account in the screenshot is approved email.",
    "url": "https://help.shamancloud.com/en/articles/10717832-content-analysis-statistics-in-shaman",
    "author_id": 5298352,
    "created_at": 1741249823,
    "updated_at": 1741336536,
    "parent_id": 11925873,
    "parent_type": "collection"
  },
  {
    "id": "10717795",
    "title": "Welcome to Usage analytics in Shaman!",
    "description": "Introducing a dynamic new data dashboard of content created in Shaman",
    "body": "In this article:\nWhat are usage analytics in Shaman?\nSearch filters\nAdditional options when viewing statistics\nWhat are usage analytics in Shaman?\nUsage analytics is a dynamic data dashboard which shows you everything you could possibly want to know about content created in Shaman, content shared via Hub, and key user activity in Shaman. We are handing you the power to review an array of data about the content which your team is creating, how much content is being shared between Shaman accounts (if Hub is active in your account) and also insightful statistics about user activity in Shaman. User Analytics allows you and your team to make strategic decisions based on key statistics to generate even more efficient content campaigns.\nConveniently placed next to the “User Management” section in Shaman, you can choose which members of your team have access to the dashboard with an easy to use toggle in the user profile.\nUsage statistics in Shaman are split into three categories:\nContent analysis:\nWhat content is being created, what type, which content is being synced to Veeva Vault, by which country, therapeutic area, for which brand, and from design template or from scratch.\nHub analysis:\nWhich content is being shared, used, liked, translated by which country, therapeutic area and for which brand.\nUser activity:\nWhich users are most active in Shaman, who is creating which content, and how frequently.\nSearch filters\nUsing the search filters at the top of the page, you can refine your statistics search to include specific countries, Shaman accounts or a specific date range.\nYou can select a single or multiple countries using the corresponding check box next to the country (or countries) you wish to select.\nIf you have multiple Shaman accounts (for example different accounts for separate therapeutic areas) you can choose a single or multiple Shaman accounts to view (using the checkbox in the drop down list of Shaman accounts).\nIn the date range section you can refine the data available to a specific time period. This is extremely useful for refining information by quarter, or even annually or monthly. Simply select the date range by either using the calendar or you can also manually input the date directly into the date range field.\nAdditional options when viewing usage analytics\nWhen you hover over each set of statistics in Shaman, you will see additional options in the top right corner of the infographic box which allow you to:\nMaximise\nView applied filters\nDrill down from Document Type\nView summary data/ Export to CSV\nTo find out more, click here for further reading about content analysis, hub analysis or user activity statistics. Or as always, reach out to your dedicated Customer Success Manager or our support team (using the green chat bubble, or\nsupport@getshaman.com\n).",
    "url": "https://help.shamancloud.com/en/articles/10717795-welcome-to-usage-analytics-in-shaman",
    "author_id": 5298352,
    "created_at": 1741249052,
    "updated_at": 1741252695,
    "parent_id": 11925873,
    "parent_type": "collection"
  },
  {
    "id": "10712321",
    "title": "New! Icon library in Shaman",
    "description": "Everything you need to know about working with icons in Shaman",
    "body": "In this article:\nIntroduction to working with icons\nHow to add icons to email content\nHow to update existing icons\nHow to delete or duplicate icons\nIntroduction to working with icons\nIcons visually communicate ideas in a simple and straightforward way, making them the perfect companion to text in email content. Icons can also boost your brand identity, and guide your reader towards the most important content in your email.\nSo we are delighted to let you know that we have added a section in the Visual library just for icons in Shaman! Official brand icons can be added in bulk by the Shaman team and then can be seamlessly made available to your content teams in branded colors.\nIf you would like to learn more about how to activate the Icon library in your Shaman account, please reach out to your dedicated Customer Success Manager.\nIf the Icon library is already active in your account, carry on reading to find out how you can easily add icons to your email content.\nHow to add icons to email content\nLet´s imagine that you have created a new email fragment or template, have completed the email details, and are now in the HTML editor ready to add elements to your email fragment or template. (If you need to revise any of these steps,\ncheck out this article here).\nFrom the menus on the right-hand side, select the content menu. Find the image icon in the content menu, and simply drag and drop that icon onto your email canvas.\nYou will notice that a grey placeholder image has been added to the email canvas. To add an icon to the email canvas instead, click the “Visual library” button from the menu on the left-hand side.\nYou will then be redirected to the visual library, where you will see the tab “Icons” available to select.\nHere you will find a list of icons supplied by your brand lead to Shaman. You can browse through the list of icons, or you can use the search bar or time filters to find the icon you are looking for:\nTo select an icon to add to your canvas, simply click the selection circle which will reveal the “Add” button in the top right hand corner:\nOnce you have clicked “Add”, you will see a list of pre-added brand colours available to select. Choose the colour which you would like to assign to the icon.\nYou will then be redirected back to the email canvas, where the icon will be added to the email canvas in the selected brand color.\nUsing the menu on the right-hand side, you can then define additional optional settings for the image.\nAuto Width: This setting is a toggle that sets an image automatically to fit the width of your email content. To set the width of an image manually, you can disable the auto width toggle and use the slider to resize your image bigger or smaller.\nAlign: This setting allows you to define the alignment of your image in relation to your email content by selecting from the left, center, right, or full alignment icons.\nAlternate Text: Alternative Text is meant to convey the “why” of the image as it relates to the content of a document or webpage. It also displays on the page if the image fails to load.\nIf you wish to have alternative text for your image, you can add it to this field simply by typing directly into the box available.\nAction: Here you can add an action such as if the email recipient clicks on the image, a specific webpage will be opened. There are several options to choose from in the dropdown menu on the right-hand side (which shows “Open Website” as a default action).\nOpen website\nSend email\nCall phone number\nSend SMS\nDepending on which option you choose, additional fields will be displayed to further personalize the action. For example, if you choose the “Open Website” option, you will need to populate the URL link in the field provided. You can also define whether a new tab is opened, or if the webpage is viewed on the same tab in the reader's browser.\nTop tip!\nWhen using the “Open website” option, we always recommend you copy the URL directly from the browser before pasting it in this URL field to avoid any typos or incorrect links.\nContainer Padding: Padding can be used to perfectly position images within the body of your email content. You can choose to add the same padding to all sides by maintaining the “All sides” toggle enabled. Or, you can disable this toggle to manually configure the padding size for each side of the image. You can use the plus and minus icons to increase or decrease the padding, or you can type a numerical value directly into the padding box.\nHide on Desktop: When this toggle is enabled, the image will not be displayed when viewing the email on a desktop computer or laptop, it will only be viewable on a mobile view.\nGood to know!\nWe highly recommend you pay attention to how your email content looks on both mobile and desktop views. To learn more great tips when creating email content compatible with mobile and desktop views, take a look at\nthis article here.\nHow to update an existing icon with a new icon\nIf you want to change an icon that has already been added to the email canvas, select the icon by clicking on it. Then, from the menu on the left-hand side, click the “Visual library” button.\nYou will be redirected back to the Visual library where you can select a different icon following the same steps as previously stated.\nYou will then be redirected back to the email canvas, where the selected icon will be added to the email canvas.\nHow to delete or duplicate icons\nTo delete an icon, simply click the icon to select it. You will then notice two icons - a bin icon to delete the image, and a copy icon to duplicate it.\nDepending on which you wish to do, simply click the icon, and your image will either be deleted or duplicated.",
    "url": "https://help.shamancloud.com/en/articles/10712321-new-icon-library-in-shaman",
    "author_id": 5298352,
    "created_at": 1741174745,
    "updated_at": 1741250857,
    "parent_id": 4027987,
    "parent_type": "collection"
  },
  {
    "id": "10704242",
    "title": "New: Animated visual!",
    "description": "How to create GIFs in the Visual builder",
    "body": "In this article:\nIntroduction\nHow to create an Animated visual in Shaman\nScenes\nLocking\nAudio\nAnimation\nExport visual component as a PDF (for MLR)\nExport visual component to Shaman visual library, or as a GIF file to your computer\nIntroduction\nYou can now create animated visual components (commonly known as GIFs) in the Shaman Visual builder! GIFs are a great way of engaging your audience by maximizing the potential of your visual content.\nBefore we get started:\nWe highly recommend that you keep GIFs as light in size as possible, as heavy visual files will cause difficulties for approved email content. The more scenes and animations you add to a visual file, the heavier/ larger the file will be.\nIf you have any doubts about creating a new visual component in Shaman, you can take a look at\nthis article\n.\nHow to create an Animated visual in Shaman\nOnce you have created a new visual component, set the obligatory information such as brand or name, and clicked the “Design” tab  and selected the “Type” of visual component you are creating, you will see the “Animated” field appear beneath “Subtype”.\nGood to know!\nCurrently Shaman supports a maximum file size of 480k pixels (800*600).\nOnce you have selected a “Subtype”, you can simply click the “Animated” checkbox and then click “Create canvas”\nYou will then be redirected to the visual builder canvas. Once you have added some visual content to the canvas, you will see the following options on the right hand side:\nScenes: If you wish to add more than one visual to the Animated GIF, you can add different “scenes” which hold the different images\nLocking: Here you can configure “locking” to prevent parts of the visual component from being edited.\nAudio: Please do not add any audio files to visual components as they are not currently supported in Shaman. Any audio files added to Animated visuals will be removed when the visual elements are added to the email builder.\nAnimation: Select an animation effect for each scene in your visual component\nAcross the bottom of the email canvas you will see some additional options for the animation element of the GIF:\nPlay scene: Click play to view the animations within the current scene you are viewing\nPlay all: Click play to preview the animations across all scenes created\nPlus icon: Shortcut to create a new scene\nCopy icon: Shortcut to duplicate a scene\nBin icon: Shortcut to delete a scene\nNavigation arrows: Shortcut to navigate between scenes\nNow that you are familiar with the GIF canvas, we will take a look at each of the following menus in more detail:\nScenes\nLocking\nAnimation\nScenes\nAs mentioned previously, you can add different “scenes” to an animated file which hold different images within the GIF. At any stage in the scene creation process you can add other text, images or shapes and add animation effects as desired\n(see the Animation section here\n).\nTo add a new scene, simply click the “Add” button in the menu on the right hand side.\nTo increase or decrease the duration of a scene, use the arrows next to the timings under the scene preview thumbnail in the menu on the right hand side.\nWhen you click the three dots under the scene preview, you will see the following additional options:\nAdd Scene name: You can add a name to your scene to help keep track of the different scenes within your animated GIF.\nClone: Click here to duplicate the scene\nSplit into scene slides: You can split a scene into further “child” scenes, allowing you to add animation effects between the same visual (applied to different scenes).\nDelete: Click here to delete a scene.\nConvert to layout: Click here to convert the scene to a layout.\nGood to know!\nLayouts work in a similar way to a design template in that you can create a layout, and then create new scenes using this layout.\nLocking\nThe “locking” tool (when used in a design template) ensures that obligatory visual (eg. a brand logo) or written information (eg. legal disclaimers, dosing information, etc) which should not be updated or edited is out of bounds for anyone but the creator of the template.\nWhat elements can I lock in Shaman?\nText\nImages (Media)\nShapes\nBackground\nAudio\nAs mentioned previously in this article: Please do not add any audio files to visual components as they are not currently supported in Shaman. Any audio files added to Animated visuals will be removed when the visual elements are added to the email builder.\nAnimation\nUsing the animation tab, a variety of animations can be applied to the “intro” or “outro” of a selected scene, or all scenes.\n“Intro” refers to the animation that can be applied to the beginning or arrival of the content element to the scene, whereas the “outro” refers to the animation that can be applied to the ending or exit of the content element from a scene.\nThe options available are:\nNone: Select this option to not apply any animation to your visual element.\nFade\nPan\nRise\nPop\nUnite\nTumble\nScale\nTrample\nSimply click an option to select it. Once you have selected an animation option, you will see two further options:\nDelay: The element(s) will not be visible until this delay has elapsed, at which point the animation will play\nDuration: This refers to how long the animation will take to complete.\nGood to know!\nIf the delay and duration together exceed the total duration of the scene, a warning message will appear advising you to adjust either delay, duration of animation or duration of the scene.\nYou see in the menu on the right hand side a button to “Apply to all elements”. This will apply the chosen animation to all content elements within the scene (if you have more than one content element on the canvas).\nOnce you are happy with the Animated visual created, the next step is to export or publish the animated visual using the “Export” page.\nExport visual component as a PDF (for MLR)\nFrom the “MLR” tab you can export a PDF document to arrive in your email inbox, or use the “Download” option to download the PDF directly to your computer.\nExport visual component to Shaman visual library, or as a GIF file to your computer\nFrom the design canvas, click the “Export” tab to be directed to the list of Export options in Shaman.\nThe first section we should review contains the “Animated gif details”, where we need to set:\nFrames per second: Here you can set the animation smoothness and file size. The higher the frames per second, the higher the animation smoothness (but also higher the file size). In general, we suggest 5 FPS or lower to keep file size manageable, especially for banners with limits. We recommend you to use higher FPS only if you are using animation effects.\nQuality: The quality is a balance between the quality of the visual and the file size. Medium is usually sufficient quality to keep the file size within size limits, whilst maintaining a good standard of image quality. You can adjust the quality based on the animation detail.\nLoop: Determines whether the animation repeats. When enabled, the animation will continuously loop. When disabled, it will play once and stop at the final frame.\nNext you can decide whether you wish to share the Animated Visual to your internal Hub (if relevant!).\nTo export your Animated visual to the Shaman library, you can click the “Export” button, or alternatively click “Send to Email” or “Download” to receive the GIF file to your inbox, or to your computer.\nAdd the GIF to your email\nTo add the GIF to your email, start by adding the image placeholder to the body of your email, then open the \"Visual Library\".\nIn the Visual Library, click on the GIF you exported from the Visual Builder.\nThe GIF will immediately be added to the email body.\nIf you have any questions or face any challenges, please reach out to our Support Team using the chat bubble on the bottom right corner, or email us at\nsupport@getshaman.com\n.",
    "url": "https://help.shamancloud.com/en/articles/10704242-new-animated-visual",
    "author_id": 5298352,
    "created_at": 1741096949,
    "updated_at": 1759246551,
    "parent_id": 10661455,
    "parent_type": "collection"
  },
  {
    "id": "10337700",
    "title": "Shaman Hub for Visual components: The basics",
    "description": "Everything you need to know about the sharing Visual components to the Hub and with other teams in your organization",
    "body": "In this article:\nWhat is Shaman Hub for Visual Components?\nWhere can I find Shaman Hub for Visual Components?\nHow does it work?\nHow can I contribute Visual Components to Shaman Hub?\nWhat is Shaman Hub for Visual Components?\nShaman Hub is available for each of our content builders, allowing the sharing of content from a global to local level, or a local to local level in a matter of clicks!\nIn this article we will take a closer look at how you can search for visual content in Shaman Hub, how you can save it to your local list of visual content to personalize and very importantly - how you can share your best visual content to Shaman Hub to inspire your colleagues and contribute to the overall success of your organization!\nWhere can I find Shaman Hub for Visual components?\nAfter logging into Shaman, click “Visuals” in your builder dashboard.\nFrom the Visual builder overview, click the “Shaman Hub” tab.\nGood to know!\nYour hub name is unique to your organization, so in your account you will see “your organization name - Hub”.\nWhen you arrive at your hub page, you will see some search filters on the left hand side, a list of content that has already been shared on your hub, as well as a search bar at the top of your screen to type keywords to help you find the right content for you. Let's take a closer look.\nYou can find the following search filters on the left:\nSource: Global and local - You can choose to search for content that has been created at a global, or local level by clicking to select the corresponding filter.\nBrand: Perhaps you are working on a specific brand team, and would like to find content relating to this specific brand. If so, this is the search filter for you.\nOriginal language: you can search for content which has been created in your local language or in other languages.\nCountry: you can search for content created by a specific country using this filter.\nType: You can use the filters “Email visual”, “Banner”, etc to find a specific type of visual content\nGood to know!\nIf you do not see a value in the list of filters, eg. a brand or a country, it is most likely that content for this brand or country has not yet been shared on the hub, but don´t hesitate to contact your Shaman Customer Success Manager or the Shaman Support Team (support@getshaman.com) for more information.\nSearch bar at the top: Simply start typing any keywords to find relevant visual content.\nList of content shared on the hub: Here you can see all content currently available on your hub, sorted based on relevancy. Let’s take a look at the information you can see in this email overview.\nTitle: The title of the visual component\nLocal or Global: Whether it has been created at a global or local level.\nSummary: An AI generated summary of the contents of the visual content (in English)\nCreated by: The name and franchise of the colleague who created this content\nLikes: How many people have “liked” the visual content\nDuplicates: How many people have duplicated the content to their local work area\nDate added: The date the content was added\nExpiry date: The date this content will expire (in Shaman Hub)\nHow does it work?\nTo take a closer look at a visual component presented in the Hub for visual builder overview, simply click anywhere within the visual component details shown.\nYou will be redirected to a page where you can preview the visual content and review the details before duplicating it.\nOn the right hand side you will see a “Duplicate visual component” section. If you like what you see in the preview, you can complete the details in the “Update details and duplicate to your account” section.\nAccount: Select the account where you wish to copy this visual content to.\nName: Add a new name or title to your visual content\nBrand: You can choose to keep the inherited brand assigned to your visual content, or you can click “Update” to change it to a different brand.\nLanguage: Select the language you wish to use in your visual content. If it´s different from the language in the original content, don´t worry we´ve got you! Shaman will automatically translate this to the language you have selected.\nOnce you have set these details, click “Duplicate”.\nYou will be redirected to the visual component overview page which you are likely to be very familiar with by now. Click “Design” to start personalizing the visual content you have copied.\nOnce in the Design section, you can start adding new elements to the visual component or update the existing content as you wish.\nGood to know!\nAs part of the Brand design system implemented by Shaman, any new content elements added by you will inherit your brand identity colours, fonts and padding requirements.\nIf you select another language in the duplication step, Shaman will automatically translate the Visual component to the selected language, using AI translation. Make sure that the translation result is reviewed carefully.\nIf you have any doubts and want to check the original text, simply click “Show original visual component”.\nTo review any steps about adding content to your visual component,\nplease click here\n, or how to export your visual component from Shaman,\nplease click here.\nHow can I contribute to Shaman Hub?\nSharing your visual content on Shaman Hub could not be easier.\nOnce you are ready to export your content to the Shaman visual library, you just need to select the \"Export\" tab of the Visual component.\nAt the top of your export options, you will see the following criteria that you can select to share with your colleagues, based on:\nBrand: You can choose to only share with colleagues working with the same brand as you\nCountries: You can choose to only share content with specific countries\nTherapeutic Area: You can choose to only share content with users working in similar therapeutic area to you, for example: Neurology, Cardiology, etc.\nAnd importantly: “Share with other users” toggle. This needs to be enabled to share content with your colleagues.\nIf you do not want to share your visual content to Shaman Hub, be sure to deactivate this toggle to prevent your visual component from being shared.\nOn clicking export, your content will also be shared to your Shaman Hub.\nIf you have any questions or doubts about Shaman Hub, please get in touch with your dedicated Customer Success manager or the support team (using the green chat bubble or contacting us at support@getshaman.com).",
    "url": "https://help.shamancloud.com/en/articles/10337700-shaman-hub-for-visual-components-the-basics",
    "author_id": 5298352,
    "created_at": 1735632989,
    "updated_at": 1735633432,
    "parent_id": null,
    "parent_type": null
  },
  {
    "id": "10301604",
    "title": "Welcome to Shaman!",
    "description": "In this article you can find handy links to access our most viewed support articles for each of the Shaman builders and hubs",
    "body": "Shaman CLM builder\nShaman CLM builder helps you to instantly convert your approved, static content to interactive html for Veeva CLM.\nWelcome to the CLM builder\nCreating new CLM content\nAdding links and interactivity\nInteraction elements\nExporting a presentation to Veeva Vault\nShaman CLM builder Hub\nShaman Connect\nShaman Slide builder\nWith the Shaman Slide Builder you can edit any existing content on slides, add new content elements (such as text, images or shapes), remove any existing items from pages and sync the slides seamlessly into your CLM builder library.\nWelcome to the Slide builder\nStarting a new Slide project\nUpdate existing text and images on Slides\nExporting slides to the Shaman CLM builder\nWorking with Slide templates\n​\nShaman Approved Email builder\nThe Shaman Email builder makes it fast and easy to create Veeva Approved Emails. By using Shaman and its drag-&-drop email builder, you can prepare Email Templates and Email Fragments, add Dynamic Tokens and directly sync them to Veeva Vault Promomats.\nWelcome to the Approved Email builder\nCreating new email content in Shaman\nExporting email content to Veeva Vault\nCreating MLR documents for email content\nUsing Veeva tokens in Approved Email content\nShaman Email builder Hub\nShaman Marketing Email builder\nShaman Marketing Builder is an easy to use DIY email creation tool optimised specifically for Marketing cloud. If you are already familiar with the Shaman Email builder, you will feel right at home in the Marketing Email Builder!\nWelcome to the Marketing Email builder\nCreating an email template in the Marketing Email builder\nExport content from the Shaman Marketing Email builder\nCreating an MLR document for Marketing Email content\n​\nShaman Visual builder\nThe Shaman Visual component Builder empowers content teams to rapidly edit, transform or translate images ready to be seamlessly added to email content in Shaman. You can find default settings to prepare images for specific contexts such as banners, social media or email visuals in record time, and with minimum effort.\nWelcome to the Visual builder\nCreating new Visual components\nUpdating existing text and images in the Visual builder\nExporting images from the Visual builder\nEditing existing images in email content (in Shaman email builders)",
    "url": "https://help.shamancloud.com/en/articles/10301604-welcome-to-shaman",
    "author_id": 5298352,
    "created_at": 1734537259,
    "updated_at": 1734540284,
    "parent_id": null,
    "parent_type": null
  },
  {
    "id": "10210921",
    "title": "Best practices when creating email content for Outlook",
    "description": "Take a look at the Shaman teams top tips when creating email content in Outlook",
    "body": "In this article:\nIntroduction\nBackground images\nWeb fonts and web safe fonts\nButtons populated with an incomplete URL or Veeva token (outlook.com)\nAnimated GIFs\nWorking with padding and images\nIntroduction\nAt Shaman, we help our users to create and test email content for a range of email inbox providers (eg. Apple mail, Gmail or Outlook) on a daily basis. We have learnt a lot of handy tips when working with different email clients over time, but the one email client provider that we receive the most questions about is: Outlook.\nPerhaps you have experienced a heading not rendering as expected when testing in Outlook, or some images which are showing with a different alignment than the one you designed? In which case, this article is for you!\nWe would like to thank our users who have inspired this article and we sincerely hope that this list of best practices and tips is helpful.\nBackground images\nIn Outlook, background images can cause other content elements which are placed in the same row to render unexpectedly.\nLet´s take a look at an example. Here you can see a background image:\nWith two images placed on top (using the Image element in the content menu):\nGmail preview:\nApple mail preview:\nOutlook preview:\nRecommendation/ solution:\nCreate a single image which layers the background image with the other content elements on top:\nGmail preview:\nApple mail preview:\nOutlook preview:\nConsider updating the email design without using a background image (for example, splitting the background image into two columns:\nGmail preview:\nApple mail preview:\nOutlook preview:\nWeb fonts and web safe fonts\nLet´s take a quick look at what are web fonts, and web safe fonts\nWeb safe fonts: Prompt the web browser to retrieve the font from the pre installed fonts on your computer. Web safe fonts (as the name suggests!) are safe to use, as it is very likely the person reading the email will have them.\nExamples: Arial, Helvetica, Tahoma, Times New Roman.\nOn the contrary, web fonts are retrieved from a server hosted by an external source (or by your own server). The variety of fonts is much greater, but - they are only supported in a limited number of email clients. And yes you have guessed it, Outlook is not one of the email clients which supports web fonts.\nExamples: Poppins, Open Sans, Roboto, Montserrat\nSo what happens in Shaman if you use a web font in Shaman, but the end user views the email content in Outlook? In Shaman, your account fonts are configured to always have a web safe back-up font, for any web font selected. For example, font selected: Montserrat, back up font: Arial.\nYou can´t see this “back up” font in the email editor, but we can see it is there, in these litmus previews that in Outlook (an email provider which does not support web fonts), the text is rendered using Arial:\nOutlook preview:\nIn apple mail preview:\nRecommendation/ Solution:\nMake sure that any fonts you are choosing (web safe fonts or web fonts) are looking good across a range of email clients. If you have any doubts about the font configuration in your account, please reach out to\nsupport@getshaman.com\n.\nButtons populated with an incomplete URL or Veeva token (outlook.com)\nAnother situation we have noticed when using Outlook.com is that when a button is populated with an incomplete URL, or with a token which is being tested in Shaman (not from Veeva CRM), the button disappears, and only the token is displayed (or in the case of an incomplete URL, nothing at all).\nWhen testing the email, the Veeva or Marketing Cloud tokens will not be recognised as a valid URL, and may cause rendering issues. When the Email is sent out from Veeva CRM or Salesforce Marketing Cloud, the tokens are replaced by valid link URL's and the button should render correctly. We always recommend final testing in a sandbox environment before making email content available in production.\nVeeva token (for Veeva hosted document in this case) in Shaman:\nOutlook.com preview:\nApple mail preview:\nIncomplete URL in Shaman:\nOutlook.com preview:\nAnimated GIFs\nSome Outlook desktop clients do not support\nanimated GIFs\n. Outlook 2016 and Outlook 2019\ndo\nsupport GIFs now, but other versions do not. So, check your version of Outlook, first!\nWorking with padding and images\nOutlook removes any padding to images when they are added to the column rather than the container padding of the image itself.\nLet´s take a look at this example, where we have three equally sized columns, containing an equally sized image in a row, with 10 px padding added to each column:\nThis is how the images render in:\nApple mail preview:\nGmail preview:\nOutlook preview:\nWe can see that not only are the images rendering without the added padded (see how they are wider than the grey text above in the Outlook preview), but also the top of the images are being cropped:\nRecommendation/ solution:\nAdd the padding to the \"General\" - \"Container Padding\" which appears when selecting the image itself:\nTo resolve the top part of the image being cropped, reduce the size of the image slightly:\nOutlook preview after changes are made:\nIt is incredibly important to ensure every person receiving your email will receive the content as you designed it, but you may be surprised to know that according to a Litmus analytics report from October 2024\nhttps://www.litmus.com/email-client-market-share\n, 4.18% of people view their email content using Outlook.\nIf you have any other examples or thoughts about creating email content for Outlook, please get in touch with us\nsupport@getshaman.com\n.",
    "url": "https://help.shamancloud.com/en/articles/10210921-best-practices-when-creating-email-content-for-outlook",
    "author_id": 5298352,
    "created_at": 1732809366,
    "updated_at": 1732889770,
    "parent_id": 4062541,
    "parent_type": "collection"
  },
  {
    "id": "10095967",
    "title": "Edit images in the Visual builder, from any image library in the Shaman email builders",
    "description": "Find out how to seamlessly edit, create and add visual components using the Shaman Visual builder from any image library",
    "body": "In this article:\nEditing existing images in email content (in Shaman email builders)\nCreating new images in email content (in Shaman email builders) using the Visual builder\nTroubleshooting: if you can´t find an image you have been working on\nRelated articles:\nHow to export content from the Visual builder to any image library in Shaman\nEditing existing images in email content (in Shaman email builders)\nSelect the image you wish to edit in the design tab of email template or fragment. Click \"image library\" from the menu on the right hand side.\nYou will see an additional banner of options across the top of your screen. The selected image will appear with options to \"Go to Shaman Visual Builder\": Edit or Duplicate.\nClick \"edit\" to open the image in the Shaman Visual builder in a new tab in your browser. You will be redirected straight to the \"Design\" tab of the image.\nWhere you can start selecting content elements (such as text, images or background) and editing them to your brief. You can also take a look at\nthis article\nin our Help Center which gives further information on how to edit content elements in the visual editor.\nOnce you have finished making the changes to the visual component, click the \"Export\" tab, followed by the \"Export update\" button.\nThe visual component will be exported to the image library in Shaman email editor. So once the sync is completed, you can simply close the current tab of your browser to return back to the image library of the email template/ fragment you are working on.\nGood to know!\nIf you hover over the thumbnail you will be able to view a larger preview of the image you have just edited, to check the changes have been made successfully.\nIf you are happy with the newly updated visual, click \"Replace\" to add it to your email content.\nAnd that´s it! It is that easy to edit existing visual content for email in Shaman.\nCreating a new image in email content (in Shaman email builders) using the Visual builder\nCreating a new image for email content using the Visual builder follows a similar process.\nFirst, drag and drop an image to your email canvas (by selecting the image icon from the content menu on the right hand side). Then click \"Image library\" from the menu on the right hand side.\nThe image library will open, along with the option to \"Create visual\". Click this to open a new tab in your browser with the Shaman Visual builder.\nA pop up window will appear which requires you to complete the following obligatory fields:\nName: Add a name for the visual component (free text field)\nBrand: Select which brand you wish to assign with this content (from a dropdown list).\nCountry (if applicable): Select which country you are creating the content for (from a dropdown list).\nLanguage: Select a language for the image (from a dropdown list). (In case you wish to overlay text on an image, the language setting selected will be used as default when you add the new text to the image.)\nOnce you have completed these fields, click “Create”:\nYou will then be directed to the Overview page of the visual component you are adding. Here, you can update the “General” information specified when the visual components was created (eg. Name, Brand, etc). Take a look at\nthis article\nfor more information.\nOnce you have completed the obligatory fields in the Overview tab, click the \"Design\" tab. You will see the options to configure a \"type\" for your visual - this refers to types of images which you would commonly be creating for email content. Take a look at\nthis article\nto find out more information.\nNext we have the “start designing” field, where you can select from the following options to begin designing your visual component:\nDepending on which option you select, you will see a slight variation in options. We recommend that you take a look a\nthis article\nfor full details on start designing with blank canvas, start with template or upload PDF artwork.\nOnce you have chosen the Type, Start designing, Subtype (and any other necessary fields), you will see the option to “create canvas”.\nThis will propel you into the next stage of the design process in Shaman, where you can start selecting content elements (such as text, images or background) and editing them to your brief. You can also take a look at\nthis article\nin our Help Center which gives further information on how to edit content elements in the visual editor.\nOnce you have finished making the changes to the visual component, click the \"Export\" tab, followed by the \"Publish\" button.\nThe visual component will be exported to the image library in Shaman email editor. So once the sync is completed, you can simply close the current tab of your browser to return back to the image library of the email template/ fragment you are working on.\nIf you are happy with the newly created visual, click anywhere on the corresponding row in the overview of images add it to your email content.\nAnd that´s it! It is that easy to create new visual content specifically for email in Shaman.\nIf you can´t find an image you have been working on, you can try checking the following:\nThe visual component has been set to \"live\" in Shaman (it has been exported from Shaman)\nThe visual component has the same brand as the email content you are working on.",
    "url": "https://help.shamancloud.com/en/articles/10095967-edit-images-in-the-visual-builder-from-any-image-library-in-the-shaman-email-builders",
    "author_id": 5298352,
    "created_at": 1730971591,
    "updated_at": 1731580526,
    "parent_id": 10661455,
    "parent_type": "collection"
  },
  {
    "id": "10010517",
    "title": "Updating existing text and images in the Visual builder",
    "description": "Take a closer look at how to edit text and images in the visual builder",
    "body": "In this article:\nUpdating and deleting existing text\nUpdating and deleting existing images\nPublishing the changes to Shaman\nIn this article we take a look at how you can update existing content on visual components that have been uploaded to the Shaman Visual builder. It could not be easier!\nUpdate or delete existing text\nFrom the visual component you are working on, navigate to the “Design” tab, followed by the visual component which has the text you wish to edit.\nHover over the text you wish to edit, then click anywhere within the text box.\nTo update text styling or formatting - you will see the text formatting option appears next to the text box, as well as the menu on the left populates with the extended list of text styling options.\nTo update the text itself - simply start typing within the text box, and click anywhere outside of the text box on the visual component when you are done.\nTo delete the text - use the bin or delete icon at the end of the text formatting menu to remove the text from the visual component.\nUpdating or deleting images\nFrom the visual component you are working on, navigate to the “Design” tab which has the image you wish to edit.\nSimply click on an image to select it.\nOnce the image has been selected, a quick access image editing menu will appear (with options to: crop, copy, align center vertical, align center horizontal, or delete) next to the image box, as well as the menu on the left populates with the extended list of image editing options.\nYou can use the dots in each corner of the image to resize it, or alternatively use the rotate icon beneath the image box to rotate the image to the left or right.\nGood to know!\nThere is not currently an option to “replace” an image, so if you wish to replace one image with another - first delete the existing image. Then, upload a new image using the handy “Upload” button underneath the slide, or simply drop the image onto the slide.\nPublishing the changes to Shaman\nTo publish the latest version of the visual component to the image library in Shaman, click the “Export” tab followed by the “Export update” button.\nThe image will then be updated in the image library in Shaman with the latest changes.\nGood to know!\nIf you have any doubts about which versions were published on which date, you can take a look at the “Design Change History” on the Visual Component Overview page.\nYou will notice that any previous live version has been moved to “Superseded”, meaning that it has been superseded by the latest published version.\nRecommended further reading:\nExporting images from the Visual asset builder",
    "url": "https://help.shamancloud.com/en/articles/10010517-updating-existing-text-and-images-in-the-visual-builder",
    "author_id": 5298352,
    "created_at": 1729245406,
    "updated_at": 1731510139,
    "parent_id": 10661455,
    "parent_type": "collection"
  },
  {
    "id": "10010130",
    "title": "Shaman Visual builder FAQs",
    "description": "Check out our list of FAQs to learn everything you need to know about the Visual Builder in Shaman",
    "body": "What is the difference between the different types, or is “type” just to organize the content in Shaman? Are types customisable per account?\nTypes and subtypes are customizable per account, and provide like a base canvas (say email banner might be 600x350px or something, suitable for the use)\nWhat is subtype? Is this customisable per account?\nYes! The subtype options available will depend on which type has been selected. You can think of type and subtype as hierarchical, with the “type” selected deciding which relevant subtypes should be available for selection. For example, if the type “banner” is selected, the subtypes available will be more specific examples of banners eg. medium rectangle or leaderboard.\nDepending which subtype you select, the corresponding default dimensions for the subtype will appear underneath. These fields are completely editable, so you can continue with the predefined default dimensions, or update them to custom values.\nWhat file formats are accepted?\nBlank canvas: create a visual component “from scratch”\nType of files accepted:\n.JPG, .PNG, .HEIC, .TIFF, .SVG, .PDF (single page PDFs)\nImport design: upload a PDF file (with one page or multiple pages) to import into the visual builder\nType of files accepted:\n.PDF - single page and multipage\n.JPG, .PNG, .HEIC, .TIFF, .SVG, .PDF (single page PDFs)\nStart with a template: You can choose to create a visual component from an existing template\nType of files accepted:\n.JPG, .PNG, .HEIC, .TIFF, .SVG, .PDF (single page PDFs)\nWhat is the difference between importing a design and starting from scratch?\nYou can choose the “Import Design” option to upload a PDF and turn it into editable items, or start from scratch. Within the visual builder, you can also upload images, but not use them as a “base” as per the “Import Design” option.\nWhy is it necessary to add a language to an image?\nIn case the image contains text, for any future translation and duplication needs.\nOnce I have set the dimensions of a visual component, it is not possible to update the component dimensions?\nYes it is! In the design step, go to “Background” and you can set the size there\nWhere can I download a PDF of my visual component?\nNavigate to the MLR tab in your visual component to find the options to download or export a PDF.\nWhere can I download a PNG or JPG of my visual component?\nNavigate to the export tab in your visual component to find the options to download or export a PDF, PNG, or JPG.\nWhere can I export the visual component to the image library in Shaman email builders?\nNavigate to the export tab in your visual component to find the option to \"Export\" the visual component to the image library in Shaman email builders.\nHow can I update a visual component in the image library in Shaman email builders?\nNavigate to the export tab of your visual component to find the option to \"Export again\". After clicking this option, the updated visual component will then be published to the image library in Shaman email builders.\nGood to know!\nIf you have any doubts about which versions were published on which date, you can take a look at the “Design Change History” on the Visual Component Overview page. You will notice that any previous live version has been moved to “Superseded”, meaning that it has been superseded by the latest published version.\nDo you have a question that is not on this list? Please contact the support team using the green chat bubble in your account, or via email (\nsupport@getshaman.com\n).",
    "url": "https://help.shamancloud.com/en/articles/10010130-shaman-visual-builder-faqs",
    "author_id": 5298352,
    "created_at": 1729237441,
    "updated_at": 1750975090,
    "parent_id": 10661455,
    "parent_type": "collection"
  },
  {
    "id": "10007717",
    "title": "Exporting images from the Visual component builder",
    "description": "Everything you need to know about exporting or downloading your visual components created in Shaman",
    "body": "In this article:\nDownloading images from Shaman\nas PDF\nas PDF, PNG or JPG\nPublishing to the Shaman email image library\nDownloading images from Shaman\nas PDF\nWithin your Visual component, navigate to the “MLR” tab:\nSelect either of the options available to:\nSend PDF to Email: receive a PDF file of the visual component created to your email\nDownload PDF: download a PDF file of the visual component created directly to your computer.\nas PDF, PNG or JPG\nFrom the export tab within the Visual component, in the “Export visual component” section select PNG, PDF or JPG from the File format options available.\nSimply click:\nSend to Email: to receive the visual component created to your email\nDownload: to download the visual component created directly to your computer.\nPublishing to the Shaman email image library\nSimply click the “Publish” button in the export tab to set your visual component live within the image library in Shaman email builders.\nA progress screen will appear showing you the sync progress.\nOnce the sync is complete, you will see that the image is now Live (available for use), as well as the date of the Last sync.\nGood to know!\nIf you want to set the image back to draft, you can do so by using the “Set back to draft” option.\nIf you have Hub for Visual components enabled in your account, you will also have the option to share the images to Hub on the export page.\nIf you wish to share the visual component to Hub, keep the \"Share content\" toggle enabled. You will also need to complete the following obligatory fields before doing so:\nVisual component summary: a brief description of what the visual component is about to ensure that the image can be easily found by your colleagues using keyword searches.\nHub expiry date: The visual component will be available to use in Shaman until the specified expiry date.\nThen, click Publish to share the content to Hub and also Shaman image libraries.\nIf you do not wish to share the visual component to Hub - simply disable the toggle \"Share content\", followed by the \"Publish\" button.\nRecommended reading:\nEdit images in the Visual builder, from any image library in the Shaman email builders",
    "url": "https://help.shamancloud.com/en/articles/10007717-exporting-images-from-the-visual-component-builder",
    "author_id": 5298352,
    "created_at": 1729180960,
    "updated_at": 1733472803,
    "parent_id": 10661455,
    "parent_type": "collection"
  },
  {
    "id": "10007634",
    "title": "Add a new background to a visual component",
    "description": "Everything you need to know about adding a new background to a visual component in the Visual Builder",
    "body": "In this article:\nHow to add a new background to a visual component\nAdding a color background\nAdding a photo as a background\nHow to add a new background to a visual component\nFrom the menu on the left hand side, select the “background” icon by clicking on it.\nYou will then see the following options available when working with backgrounds:\nColor: add a solid color to the background\nPhoto: add a photo as background\nSize: Amend the size of your background\nAdding a color background\nAfter clicking the “Color” option, you will see a small color sample which can be clicked to reveal the color picker tool.\nYou can either select the background fill color using a hex code, the color picker tool or one of the predefined brand colors already added to your account.\nAdding a photo as a background\nMoving onto the “photo” option. To add a photo as the background to a visual component, click “Photo” option to reveal a series of additional options:\nUpload: Select this option to upload an image from your computer\nPhotos: Select this option to browse existing images found in your visual components\nOnce you have selected the image you wish to set as your background, you will see an option to scale the image before it is set as the background:\nGood to know!\nAccepted file types here: .JPG, .PNG, .HEIC, .TIFF, .SVG\nYou will see additional options once you have uploaded a Photo as a background:\nReplace image: Select this option if you wish to update the background image to a new image file.\nReposition: Choose this option to rescale the background image of the visual component.\nResize: doubt (checking on Q+A)\nFilters: use the different filter sliders to:\nAdd a color overlay\nIncrease exposure\nIncrease brightness\nIncrease contrast\nIncrease saturation\nIncrease vibrance\nIncrease hue\nIncrease blur",
    "url": "https://help.shamancloud.com/en/articles/10007634-add-a-new-background-to-a-visual-component",
    "author_id": 5298352,
    "created_at": 1729179828,
    "updated_at": 1731514035,
    "parent_id": 10661455,
    "parent_type": "collection"
  }
]